99_cats/cats/app/controllers/cat_rental_requests_controller.rb

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def show
        @cat_rental = CatRentalRequest.find(params[:id])

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cat_id", 5], ["start_date", "2021-09-12"], ["end_date", "2021-09-30"], ["created_at", "2021-09-17 21:20:50.874822"], ["updated_at", "2021-09-17 21:20:50.874822"]]
---
    def create
        @cat_rental = CatRentalRequest.new(rental_params)
        if @cat_rental.save