99_cats/cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birthdate", "color", "name", "sex", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @cat = Cat.new(cat_params)
        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = ?, "description" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["sex", "M"], ["description", "        Emily is a fat cat.\r\n    "], ["updated_at", "2021-09-17 19:27:14.566564"], ["id", 9]]
---
    def update
        @cat = Cat.find(params[:id])

        if @cat.update(cat_params)